clear all
close all
clc
N=1000; % кол-во абонентов для формирования Q и R
lamda=[0:(1/N)/20:1/N]; % интенсивность входного потока для Q и R 
T=zeros(1,length(lamda)); % создаем массив (среднее время пребывания заввки в буфере (очередь)
for i=2:length(lamda) % создаем цикл, где находим Q и R для каждой lamda
    Q=zeros(1,N); % объявление массива (кол-во заявок в буфере)
    R=sum(randsrc(N,N,[0 1; 1-lamda(i) lamda(i)]));  % формируется матрица N X N внутри sum, складываются значения по столбцам и формируется массив прешед заявок
    Q(1)=0; % первый элемент массива Q равен первому элементу массива R в первый момент когда буфер пустой 
    for h=2:N % массив со второй элемента до N
        if Q(h-1)>0
            Q(h)=Q(h-1)+R(h)-1;
        else
            Q(h)=R(h);
        end;
    end;
    T(i)= mean(Q)/lamda(i);% (по теореме литтла N = lambda * T) mean(Q) - среднее кол-ко заявок в буфере T - среднее время пребыания заявки в буфере
end;

figure(1)
plot(lamda,T)
grid on